{
  "architectures": [
    "KrakenForCausalLM"
  ],
  "config_dict": {
    "class_indices": {
      "LABEL_0": 0,
      "LABEL_1": 1,
      "LABEL_2": 2,
      "LABEL_3": 3,
      "LABEL_4": 4
    },
    "model_type": "kraken",
    "models": {
      "expert1": "cognitivecomputations/dolphin-2.9.1-yi-1.5-34b",
      "expert2": "gorilla-llm/gorilla-openfunctions-v2",
      "expert3": "ise-uiuc/Magicoder-S-DS-6.7B",
      "expert4": "defog/llama-3-sqlcoder-8b",
      "expert5": "VAGOsolutions/Llama-3-SauerkrautLM-8b-Instruct"
    },
    "quantization": {
      "expert1": "4bit",
      "expert2": null,
      "expert3": null,
      "expert4": null,
      "expert5": null
    },
    "router": "./kraken_router",
    "tokenizers": {
      "expert1": "cognitivecomputations/dolphin-2.9.1-yi-1.5-34b",
      "expert2": "gorilla-llm/gorilla-openfunctions-v2",
      "expert3": "ise-uiuc/Magicoder-S-DS-6.7B",
      "expert4": "defog/llama-3-sqlcoder-8b",
      "expert5": "VAGOsolutions/Llama-3-SauerkrautLM-8b-Instruct"
    }
  },
  "model_type": "kraken",
  "torch_dtype": "float32",
  "transformers_version": "4.41.0"
}
